In [38]:
#!pip install pandas
#instalarlo

In [39]:
import pandas

In [40]:
df=pandas.read_excel( r"C:\Users\jacj2\Downloads\bd_con_excel.xlsx")

In [41]:
df.shape

(4, 3)

In [42]:
df.head()

     Nombre  Sueldo  Apellido
0     Matha    1000   Jimenez
1     Pedro    1500     Ortiz
2  Juaquin      500  Martinez
3    Andrea     700     Perez

In [43]:
df["Nombre"][2]#[:-1]

'Juaquin '

In [44]:
df["Nombre"][2]=df["Nombre"][2][:-1]

C:\Users\jacj2\AppData\Local\Temp\ipykernel_21528\1787574071.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Nombre"][2]=df["Nombre"][2][:-1]
C:\Users\jacj2\AppData\Local\Temp\ipykernel_21528\1787574071.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Nombre"][2]=df["Nombre"][2][:-1]

In [45]:
df["Nombre"][2]

'Juaquin'

In [46]:
df.columns

Index(['Nombre', 'Sueldo', 'Apellido'], dtype='object')

In [47]:
df.head()

    Nombre  Sueldo  Apellido
0    Matha    1000   Jimenez
1    Pedro    1500     Ortiz
2  Juaquin     500  Martinez
3   Andrea     700     Perez

In [48]:
# vamos a hacer los correos
df['Apellido']
df['Nombre']

0      Matha
1      Pedro
2    Juaquin
3     Andrea
Name: Nombre, dtype: object

In [49]:
df.shape[0]

4

In [ ]:
# version donde no se repiten nombres
lista_correos=[]
for correo in range(df.shape[0]):
    apellido_junto_nombre=df['Apellido'][correo]+"."+df['Nombre'][correo]+"@python.com.co"
    lista_correos.append(apellido_junto_nombre)

In [ ]:
#Opcion 1 , validar en lista los duplicados 
lista_correos=[]
for correo in range(df.shape[0]):
    apellido_junto_nombre=df['Apellido'][correo]+"."+df['Nombre'][correo]+"@python.com.co"
    if apellido_junto_nombre in lista_correos:
        apellido_junto_nombre=df['Apellido'][correo]+"."+df['Nombre'][correo]+".contractor@python.com.co"
        lista_correos.append(apellido_junto_nombre)

In [51]:
df["Correos_corporativos"]=lista_correos

In [56]:
df.shape

(4, 4)

In [57]:
len(df["Correos_corporativos"].unique())

4

In [66]:
df["Correos_corporativos"].drop_duplicates()

0       Jimenez.Matha@python.com.co
1         Ortiz.Pedro@python.com.co
2    Martinez.Juaquin@python.com.co
3        Perez.Andrea@python.com.co
Name: Correos_corporativos, dtype: object

In [ ]:
df

In [52]:
df.shape

(4, 4)

In [53]:
df

    Nombre  Sueldo  Apellido            Correos_corporativos
0    Matha    1000   Jimenez     Jimenez.Matha@python.com.co
1    Pedro    1500     Ortiz       Ortiz.Pedro@python.com.co
2  Juaquin     500  Martinez  Martinez.Juaquin@python.com.co
3   Andrea     700     Perez      Perez.Andrea@python.com.co

In [54]:
df.to_csv(r"C:\Users\jacj2\OneDrive\Desktop\clases_erick\Scripts\base_datos_con_correos1.csv")

In [59]:
lista_de_aumentos=[1.2,1.01,2,1.5]

In [62]:
df["Aumentos anuales"]=lista_de_aumentos
df.head()

,Nombre,Sueldo,Apellido,Correos_corporativos,Aumentos,Aumentos anuales
0,Matha,1000,Jimenez,Jimenez.Matha@python.com.co,1.20,1.20
1,Pedro,1500,Ortiz,Ortiz.Pedro@python.com.co,1.01,1.01
2,Juaquin,500,Martinez,Martinez.Juaquin@python.com.co,2.00,2.00
3,Andrea,700,Perez,Perez.Andrea@python.com.co,1.50,1.50

In [63]:
df["Sueldo2025"]=df.Sueldo*df.Aumentos

In [64]:
df

,Nombre,Sueldo,Apellido,Correos_corporativos,Aumentos,Aumentos anuales,Sueldo2025
0,Matha,1000,Jimenez,Jimenez.Matha@python.com.co,1.20,1.20,1200.0
1,Pedro,1500,Ortiz,Ortiz.Pedro@python.com.co,1.01,1.01,1515.0
2,Juaquin,500,Martinez,Martinez.Juaquin@python.com.co,2.00,2.00,1000.0
3,Andrea,700,Perez,Perez.Andrea@python.com.co,1.50,1.50,1050.0